lkolbly/cmsis-svd/data/TexasInstruments/LM4F132E5QC.svd
        <register>
          <name>TXCSRH3</name>
          <description>USB Transmit Control and Status Endpoint 3 High</description>
          <addressOffset>0x00000133</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH3_DT</name>
              <description>Data Toggle</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH3_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH3_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH3_FDT</name>
              <description>Force Data Toggle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH3_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH3_MODE</name>
              <description>Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH3_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH3_AUTOSET</name>
              <description>Auto Set</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMAXP3</name>
          <description>USB Maximum Receive Data Endpoint 3</description>
          <addressOffset>0x00000134</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP3_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL3</name>
          <description>USB Receive Control and Status Endpoint 3 Low</description>
          <addressOffset>0x00000136</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL3_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL3_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL3_OVER</name>
              <description>Overrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL3_DATAERR</name>
              <description>Data Error</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL3_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL3_STALL</name>
              <description>Send STALL</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL3_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL3_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL3</name>
          <description>USB Receive Control and Status Endpoint 3 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000136</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL3_ERROR</name>
              <description>Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL3_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL3_REQPKT</name>
              <description>Request Packet</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH3</name>
          <description>USB Receive Control and Status Endpoint 3 High</description>
          <addressOffset>0x00000137</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH3_DT</name>
              <description>Data Toggle</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH3_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH3_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH3_PIDERR</name>
              <description>PID Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH3_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH3_AUTORQ</name>
              <description>Auto Request</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH3_AUTOCL</name>
              <description>Auto Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH3</name>
          <description>USB Receive Control and Status Endpoint 3 High</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000137</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH3_DISNYET</name>
              <description>Disable NYET</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH3_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCOUNT3</name>
          <description>USB Receive Byte Count Endpoint 3</description>
          <addressOffset>0x00000138</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT3_COUNT</name>
              <description>Receive Packet Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXTYPE3</name>
          <description>USB Host Transmit Configure Type Endpoint 3</description>
          <addressOffset>0x0000013A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXTYPE3_TEP</name>
              <description>Target Endpoint Number</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_TXTYPE3_PROTO</name>
              <description>Protocol</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE3_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE3_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE3_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE3_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE3_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE3_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE3_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE3_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERVAL3</name>
          <description>USB Host Transmit Interval Endpoint 3</description>
          <addressOffset>0x0000013B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXINTERVAL3_TXPOLL</name>
              <description>TX Polling</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERVAL3</name>
          <description>USB Host Transmit Interval Endpoint 3</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x0000013B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXINTERVAL3_NAKLMT</name>
              <description>NAK Limit</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXTYPE3</name>
          <description>USB Host Configure Receive Type Endpoint 3</description>
          <addressOffset>0x0000013C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXTYPE3_TEP</name>
              <description>Target Endpoint Number</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_RXTYPE3_PROTO</name>
              <description>Protocol</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE3_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE3_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE3_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE3_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXTYPE3_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE3_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE3_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE3_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL3</name>
          <description>USB Host Receive Polling Interval Endpoint 3</description>
          <addressOffset>0x0000013D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXINTERVAL3_TXPOLL</name>
              <description>RX Polling</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL3</name>
          <description>USB Host Receive Polling Interval Endpoint 3</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x0000013D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXINTERVAL3_NAKLMT</name>
              <description>NAK Limit</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP4</name>
          <description>USB Maximum Transmit Data Endpoint 4</description>
          <addressOffset>0x00000140</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP4_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL4</name>
          <description>USB Transmit Control and Status Endpoint 4 Low</description>
          <addressOffset>0x00000142</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL4_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL4_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL4_ERROR</name>
              <description>Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL4_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL4_SETUP</name>
              <description>Setup Packet</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL4_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL4_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL4_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL4</name>
          <description>USB Transmit Control and Status Endpoint 4 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000142</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL4_UNDRN</name>
              <description>Underrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL4_STALL</name>
              <description>Send STALL</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRH4</name>
          <description>USB Transmit Control and Status Endpoint 4 High</description>
          <addressOffset>0x00000143</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH4_DT</name>
              <description>Data Toggle</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH4_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH4_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH4_FDT</name>
              <description>Force Data Toggle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH4_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH4_MODE</name>
              <description>Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH4_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH4_AUTOSET</name>
              <description>Auto Set</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMAXP4</name>
          <description>USB Maximum Receive Data Endpoint 4</description>
          <addressOffset>0x00000144</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP4_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL4</name>
          <description>USB Receive Control and Status Endpoint 4 Low</description>
          <addressOffset>0x00000146</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL4_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL4_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL4_OVER</name>
              <description>Overrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL4_DATAERR</name>
              <description>Data Error</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL4_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL4_STALL</name>
              <description>Send STALL</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL4_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL4_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL4</name>
          <description>USB Receive Control and Status Endpoint 4 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000146</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL4_ERROR</name>
              <description>Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL4_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL4_REQPKT</name>
              <description>Request Packet</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH4</name>
          <description>USB Receive Control and Status Endpoint 4 High</description>
          <addressOffset>0x00000147</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH4_DT</name>
              <description>Data Toggle</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH4_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH4_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH4_PIDERR</name>
              <description>PID Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH4_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH4_AUTORQ</name>
              <description>Auto Request</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH4_AUTOCL</name>
              <description>Auto Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
